zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp255dxx_cm0.h
/**
  ******************************************************************************
  * @file    stm32mp255dxx_cm0.h
  * @author  MCD Application Team
  * @brief   CMSIS stm32mp255dxx_cm0 Device Peripheral Access Layer Header File.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral registers declarations and bits definition
  *           - Macros to access peripherals registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2022 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/** @addtogroup CMSIS_Device
  * @{
  */

/** @addtogroup stm32mp255dxx_cm0
  * @{
  */

#ifndef __STM32MP255Dxx_CM0_H
#define __STM32MP255Dxx_CM0_H

#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */

 /**
 * @brief stm32mp2_m0plus Interrupt Number Definition :
 *        - according to the selected device in @ref Library_configuration_section
 *        - according to "Table 233. interrupt mapping for Cortex-M0+"
 *          in chapitre 32 "interrupt list" of reference document
 *          RM0457 - Reference Manual - STM32MP25xx - advanced ARM-based 32/64-bit MPUs
 *          file "DM00485804 (RM0457) Rev0.2.pdf" (Revision 0.2 / 27-Jul-2021)
 */

/*!< Interrupt Number Definition */
typedef enum
{
/******  Cortex-M0+ Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt                                          */
  HardFault_IRQn              = -13,    /*!< 3 Cortex-M Hard Fault Interrupt                                   */
  SVC_IRQn                    = -5,     /*!< 11 Cortex-M SV Call Interrupt                                     */
  PendSV_IRQn                 = -2,     /*!< 14 Cortex-M Pend SV Interrupt                                     */
  SysTick_IRQn                = -1,     /*!< 15 Cortex-M System Tick Interrupt                                 */
/******  STM32mp2xxxx specific Interrupt Numbers ***************************************************************/
  IWDG5_IRQn                  = 0,     /*!< Independent Watchdog 5 Early interrupt                             */
  WWDG2_IRQn                  = 1,     /*!< Window Watchdog 2 Early Wakeup interrupt                           */
  TAMP_IRQn                   = 2,     /*!< Tamper interrupt                                                   */
  RESERVED_3                  = 3,     /*!< reserved                                                           */
  RESERVED_4                  = 4,     /*!< reserved                                                           */
  EXTI2_L_IRQn                = 5,     /*!< EXTI2 lines 0 to 7 interrupt                                       */
  EXTI2_H_IRQn                = 6,     /*!< EXTI2 lines 8 to 15 interrupt                                      */
  LPDMA_Channel0_IRQn         = 7,     /*!< LPDMA Channel0 interrupt                                           */
  LPDMA_Channel1_IRQn         = 8,     /*!< LPDMA Channel1 interrupt                                           */
  LPDMA_Channel2_IRQn         = 9,     /*!< LPDMA Channel2 interrupt                                           */
  LPDMA_Channel3_IRQn         = 10,    /*!< LPDMA Channel3 interrupt                                           */
  LPUART1_IRQn                = 11,    /*!< LPUART1 global interrupt                                           */
  SPI8_IRQn                   = 12,    /*!< SPI8 global interrupt                                              */
  IPCC2_RX_IRQn               = 13,    /*!< Mailbox 2 RX Occupied interrupt                                    */
  IPCC2_TX_IRQn               = 14,    /*!< Mailbox 2 TX Free interrupt                                        */
  I2C8_IRQn                   = 15,    /*!< I2C8 global interrupt                                              */
  I3C4_IRQn                   = 16,    /*!< I3C4 global interrupt                                              */
  RESERVED_17                 = 17,    /*!< reserved                                                           */
  LPTIM3_IRQn                 = 18,    /*!< LPTIMER3 global interrupt                                          */
  LPTIM4_IRQn                 = 19,    /*!< LPTIMER4 global interrupt                                          */
  LPTIM5_IRQn                 = 20,    /*!< LPTIMER5 global interrupt                                          */
  HSEM_IRQn                   = 21,    /*!< HSEM non-secure interrupt                                          */
  RESERVED_22                 = 22,    /*!< reserved                                                           */
  ADF1_FLT_IRQn               = 23,    /*!< ADF1 Filter global interrupt                                       */
  RESERVED_24                 = 24,    /*!< reserved                                                           */
  CPU1_SEV_IRQn               = 25,    /*!< Cortex-A35 Send Event through EXTI2                                */
  CPU2_SEV_IRQn               = 26,    /*!< Cortex-M33 Send Event through EXTI2                                */
  VDDCPU_VD_IRQn              = 27,    /*!< VDDCPU voltage detector interrupt                                  */
  VDDCORE_VD_IRQn             = 28,    /*!< VDDCORE voltage detector interrupt                                 */
  RESERVED_29                 = 29,    /*!< reserved                                                           */
  CTI_IRQ0_IRQn               = 30,    /*!< CTI IRQ0                                                           */
  CTI_IRQ1_IRQn               = 31,    /*!< CTI IRQ1                                                           */
  MAX_IRQ_n
/***************************************************************************************************************/
} IRQn_Type;
/**
  * @}
  */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */

#define SDC        /*!< Step Down Converter feature */

/**
  * @brief Configuration of the Cortex-M0+ Processor and Core Peripherals
  */
#define __CM0PLUS_REV             0x0001  /*!< Cortex-M0+ revision r0p1                       */
#define __MPU_PRESENT             1       /*!< CM0+ provides MPU                              */
#define __VTOR_PRESENT            0       /*!< Vector Table Offset Register NOT present       */
#define __NVIC_PRIO_BITS          2       /*!< CM0+ uses 2 Bits for the Priority Levels       */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used   */
#define __FPU_PRESENT             0       /*!< FPU NOT present                                */

#include "core_cm0plus.h"                 /*!< Cortex-M0+ processor and core peripherals      */

/**
  * @}
  */

#include "system_stm32mp2xx.h"
#include <stdint.h>

