zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp255dxx_cm0.h
/*
 * @brief Window Watchdog (WWDG)
 */
typedef struct
{
  __IO uint32_t CR;              /*!< Control register                     Address offset: 0x000 */
  __IO uint32_t CFR;             /*!< Configuration register               Address offset: 0x004 */
  __IO uint32_t SR;              /*!< Status register                      Address offset: 0x008 */
       uint32_t RESERVED0[249];  /*!< Reserved                             Address offset: 0x00C-0x3EC */
  __IO uint32_t HWCFGR;          /*!< WWDG hardware configuration register Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< WWDG version register                Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< WWDG ID register                     Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< WWDG size ID register                Address offset: 0x3FC */
} WWDG_TypeDef;

/**
  * @}
  */

/**
 * @}
 */

/** @addtogroup Peripheral_declaration
  * @{
  */
/**
 * @brief stm32mp2 base addresses Definitions :
 */
#define PERIPH_SIZE                         (0x10000000UL)  /*!< Size of : AHB/APB Peripherals                                  */

#define SRAMS_SIZE                          (0x10000000UL)  /*!< Size of : SRAMs memory region                                  */

#define LPSRAM1_SIZE                        (   8UL *1024UL) /*!< Unit is Byte                                                   */
#define LPSRAM2_SIZE                        (   8UL *1024UL) /*!< Unit is Byte                                                   */
#define LPSRAM3_SIZE                        (  16UL *1024UL) /*!< Unit is Byte                                                   */

/*!< Peripherals */
#define PERIPH_BASE                         (0x40000000UL)  /*!< Base address of : AHB/APB Peripherals                          */

/*!< Memories */
#define SRAMS_BASE                          (0x20000000UL)  /*!< Base address of : SRAMs region                                 */

#define LPSRAM1_BASE                        (SRAMS_BASE + 0x000C0000UL)     /*!< Base address of : Low Power System RAM                   */
#define LPSRAM2_BASE                        (SRAMS_BASE + 0x000C2000UL)     /*!< Base address of : Low Power System RAM                   */
#define LPSRAM3_BASE                        (SRAMS_BASE + 0x000C4000UL)     /*!< Base address of : Low Power System RAM                   */

/*!< Peripheral buses */
#define AHB3_PERIPH_BASE                    (PERIPH_BASE + 0x02000000UL)
#define AHB4_PERIPH_BASE                    (PERIPH_BASE + 0x04200000UL)
#define SMART_RUN_APB_PERIPH_BASE           (PERIPH_BASE + 0x06000000UL)
#define SMART_RUN_AHB_PERIPH_BASE           (PERIPH_BASE + 0x06200000UL)

#define RIFSC_BASE                          (AHB3_PERIPH_BASE + 0x080000UL)
#define RISC_BASE                           (RIFSC_BASE)
/*!< AHB4 peripherals */
#define PWR_BASE                            (AHB4_PERIPH_BASE + 0x10000UL)

/*!< SMART_RUN_APB peripherals */
#define RTC_BASE                            (SMART_RUN_APB_PERIPH_BASE + 0x00000UL)
#define TAMP_BASE                           (SMART_RUN_APB_PERIPH_BASE + 0x10000UL)
#define SPI8_BASE                           (SMART_RUN_APB_PERIPH_BASE + 0x20000UL)
#define LPUART1_BASE                        (SMART_RUN_APB_PERIPH_BASE + 0x30000UL)
#define I2C8_BASE                           (SMART_RUN_APB_PERIPH_BASE + 0x40000UL)
#define LPTIM3_BASE                         (SMART_RUN_APB_PERIPH_BASE + 0x50000UL)
#define LPTIM4_BASE                         (SMART_RUN_APB_PERIPH_BASE + 0x60000UL)
#define LPTIM5_BASE                         (SMART_RUN_APB_PERIPH_BASE + 0x70000UL)
#define I3C4_BASE                           (SMART_RUN_APB_PERIPH_BASE + 0x80000UL)
#define IWDG5_BASE                          (SMART_RUN_APB_PERIPH_BASE + 0x90000UL)
#define WWDG2_BASE                          (SMART_RUN_APB_PERIPH_BASE + 0xA0000UL)

/*!< SMART_RUN_AHB peripherals */
#define GPIOZ_BASE                          (SMART_RUN_AHB_PERIPH_BASE + 0x00000UL)
#define LPDMA_BASE                          (SMART_RUN_AHB_PERIPH_BASE + 0x10000UL)
#define ADF1_BASE                           (SMART_RUN_AHB_PERIPH_BASE + 0x20000UL)
#define ADF1_Filter0_BASE                   (ADF1_BASE + 0x80UL)
#define EXTI2_BASE                          (SMART_RUN_AHB_PERIPH_BASE + 0x30000UL)
#define EXTI2_C1_BASE                       (EXTI2_BASE + 0x80UL)
#define EXTI2_C2_BASE                       (EXTI2_BASE + 0xC0UL)
#define EXTI2_C3_BASE                       (EXTI2_BASE + 0x100UL)
#define HSEM_BASE                           (SMART_RUN_AHB_PERIPH_BASE + 0x40000UL)
#define IPCC2_BASE                          (SMART_RUN_AHB_PERIPH_BASE + 0x50000UL)
#define IPCC2_C1_BASE                       (IPCC2_BASE)
#define IPCC2_C2_BASE                       (IPCC2_BASE + 0x10UL)

#define LPDMA_Channel0_BASE                 (LPDMA_BASE + 0x0050UL)
#define LPDMA_Channel1_BASE                 (LPDMA_BASE + 0x00D0UL)
#define LPDMA_Channel2_BASE                 (LPDMA_BASE + 0x0150UL)
#define LPDMA_Channel3_BASE                 (LPDMA_BASE + 0x01D0UL)

/**
  * @}
  */
#define RISC                                ((RISC_TypeDef *)     RISC_BASE)
#define PWR                                 ((PWR_TypeDef *) PWR_BASE)
#define RTC                                 ((RTC_TypeDef *) RTC_BASE)
#define TAMP                                ((TAMP_TypeDef *) TAMP_BASE)
#define SPI8                                ((SPI_TypeDef *) SPI8_BASE)
#define LPUART1                             ((USART_TypeDef *) LPUART1_BASE)
#define I2C8                                ((I2C_TypeDef *) I2C8_BASE)
#define LPTIM3                              ((LPTIM_TypeDef *) LPTIM3_BASE)
#define LPTIM4                              ((LPTIM_TypeDef *) LPTIM4_BASE)
#define LPTIM5                              ((LPTIM_TypeDef *) LPTIM5_BASE)
#define I3C4                                ((I3C_TypeDef *) I3C4_BASE)
#define IWDG5                               ((IWDG_TypeDef *) IWDG5_BASE)
#define WWDG2                               ((WWDG_TypeDef *) WWDG2_BASE)

#define GPIOZ                               ((GPIO_TypeDef *) GPIOZ_BASE)
#define LPDMA                               ((DMA_TypeDef *) LPDMA_BASE)
#define ADF1                                ((MDF_TypeDef *) ADF1_BASE)
#define ADF1_Filter0                        ((MDF_Filter_TypeDef*) ADF1_Filter0_BASE)
#define EXTI2                               ((EXTI_TypeDef *) EXTI2_BASE)
#define EXTI2_C1                            ((EXTI_Core_TypeDef *) EXTI2_C1_BASE)
#define EXTI2_C2                            ((EXTI_Core_TypeDef *) EXTI2_C2_BASE)
#define EXTI2_C3                            ((EXTI_Core_TypeDef *) EXTI2_C3_BASE)
#define HSEM                                ((HSEM_TypeDef *) HSEM_BASE)
#define HSEM_COMMON                         ((HSEM_Common_TypeDef *) (HSEM_BASE + 0x120UL))
#define IPCC2                               ((IPCC_TypeDef *) IPCC2_BASE)
#define IPCC2_C1                            ((IPCC_CommonTypeDef *) IPCC2_C1_BASE)
#define IPCC2_C2                            ((IPCC_CommonTypeDef *) IPCC2_C2_BASE)

#define LPDMA_Channel0                      ((DMA_Channel_TypeDef *) LPDMA_Channel0_BASE)
#define LPDMA_Channel1                      ((DMA_Channel_TypeDef *) LPDMA_Channel1_BASE)
#define LPDMA_Channel2                      ((DMA_Channel_TypeDef *) LPDMA_Channel2_BASE)
#define LPDMA_Channel3                      ((DMA_Channel_TypeDef *) LPDMA_Channel3_BASE)

/**
  * @}
  */

/** @addtogroup Exported_constants
  * @{
  */

  /** @addtogroup Peripheral_Registers_Bits_Definition
  * @{
  */

/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                             DMA Controller                                 */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for DMA_SECCFGR register  ****************/
#define DMA_VER_V1_3

