zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp255dxx_cm0.h
/***************  Bit definition for DMA_RCFGLOCKR register  ***************/
#define DMA_RCFGLOCKR_LOCK0_Pos  (0U)
#define DMA_RCFGLOCKR_LOCK0_Msk  (0x1UL << DMA_RCFGLOCKR_LOCK0_Pos)             /*!< 0x00000001 */
#define DMA_RCFGLOCKR_LOCK0      DMA_RCFGLOCKR_LOCK0_Msk                       /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK1_Pos  (1U)
#define DMA_RCFGLOCKR_LOCK1_Msk  (0x1UL << DMA_RCFGLOCKR_LOCK1_Pos)             /*!< 0x00000002 */
#define DMA_RCFGLOCKR_LOCK1      DMA_RCFGLOCKR_LOCK1_Msk                       /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK2_Pos  (2U)
#define DMA_RCFGLOCKR_LOCK2_Msk  (0x1UL << DMA_RCFGLOCKR_LOCK2_Pos)             /*!< 0x00000004 */
#define DMA_RCFGLOCKR_LOCK2      DMA_RCFGLOCKR_LOCK2_Msk                       /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK3_Pos  (3U)
#define DMA_RCFGLOCKR_LOCK3_Msk  (0x1UL << DMA_RCFGLOCKR_LOCK3_Pos)             /*!< 0x00000008 */
#define DMA_RCFGLOCKR_LOCK3      DMA_RCFGLOCKR_LOCK3_Msk                       /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK4_Pos  (4U)
#define DMA_RCFGLOCKR_LOCK4_Msk  (0x1UL << DMA_RCFGLOCKR_LOCK4_Pos)             /*!< 0x00000010 */
#define DMA_RCFGLOCKR_LOCK4      DMA_RCFGLOCKR_LOCK4_Msk                       /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK5_Pos  (5U)
#define DMA_RCFGLOCKR_LOCK5_Msk  (0x1UL << DMA_RCFGLOCKR_LOCK5_Pos)             /*!< 0x00000020 */
#define DMA_RCFGLOCKR_LOCK5      DMA_RCFGLOCKR_LOCK5_Msk                       /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK6_Pos  (6U)
#define DMA_RCFGLOCKR_LOCK6_Msk  (0x1UL << DMA_RCFGLOCKR_LOCK6_Pos)             /*!< 0x00000040 */
#define DMA_RCFGLOCKR_LOCK6      DMA_RCFGLOCKR_LOCK6_Msk                       /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK7_Pos  (7U)
#define DMA_RCFGLOCKR_LOCK7_Msk  (0x1UL << DMA_RCFGLOCKR_LOCK7_Pos)             /*!< 0x00000080 */
#define DMA_RCFGLOCKR_LOCK7      DMA_RCFGLOCKR_LOCK7_Msk                       /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK8_Pos  (8U)
#define DMA_RCFGLOCKR_LOCK8_Msk  (0x1UL << DMA_RCFGLOCKR_LOCK8_Pos)             /*!< 0x00000100 */
#define DMA_RCFGLOCKR_LOCK8      DMA_RCFGLOCKR_LOCK8_Msk                       /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK9_Pos  (9U)
#define DMA_RCFGLOCKR_LOCK9_Msk  (0x1UL << DMA_RCFGLOCKR_LOCK9_Pos)             /*!< 0x00000200 */
#define DMA_RCFGLOCKR_LOCK9      DMA_RCFGLOCKR_LOCK9_Msk                       /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK10_Pos (10U)
#define DMA_RCFGLOCKR_LOCK10_Msk (0x1UL << DMA_RCFGLOCKR_LOCK10_Pos)            /*!< 0x00000400 */
#define DMA_RCFGLOCKR_LOCK10     DMA_RCFGLOCKR_LOCK10_Msk                      /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK11_Pos (11U)
#define DMA_RCFGLOCKR_LOCK11_Msk (0x1UL << DMA_RCFGLOCKR_LOCK11_Pos)            /*!< 0x00000800 */
#define DMA_RCFGLOCKR_LOCK11     DMA_RCFGLOCKR_LOCK11_Msk                      /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK12_Pos (12U)
#define DMA_RCFGLOCKR_LOCK12_Msk (0x1UL << DMA_RCFGLOCKR_LOCK12_Pos)            /*!< 0x00001000 */
#define DMA_RCFGLOCKR_LOCK12     DMA_RCFGLOCKR_LOCK12_Msk                      /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK13_Pos (13U)
#define DMA_RCFGLOCKR_LOCK13_Msk (0x1UL << DMA_RCFGLOCKR_LOCK13_Pos)            /*!< 0x00002000 */
#define DMA_RCFGLOCKR_LOCK13     DMA_RCFGLOCKR_LOCK13_Msk                      /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK14_Pos (14U)
#define DMA_RCFGLOCKR_LOCK14_Msk (0x1UL << DMA_RCFGLOCKR_LOCK14_Pos)            /*!< 0x00004000 */
#define DMA_RCFGLOCKR_LOCK14     DMA_RCFGLOCKR_LOCK14_Msk                      /*!< lock the configuration of the DMA_SECCFGR */
#define DMA_RCFGLOCKR_LOCK15_Pos (15U)
#define DMA_RCFGLOCKR_LOCK15_Msk (0x1UL << DMA_RCFGLOCKR_LOCK15_Pos)            /*!< 0x00008000 */
#define DMA_RCFGLOCKR_LOCK15     DMA_RCFGLOCKR_LOCK15_Msk                      /*!< lock the configuration of the DMA_SECCFGR */

/*******************  Bit definition for DMA_MISR register  ****************/
#define DMA_MISR_MIS0_Pos        (0U)
#define DMA_MISR_MIS0_Msk        (0x1UL << DMA_MISR_MIS0_Pos)                  /*!< 0x00000001 */
#define DMA_MISR_MIS0            DMA_MISR_MIS0_Msk                            /*!< Masked Interrupt State of Non-Secure Channel 0 */
#define DMA_MISR_MIS1_Pos        (1U)
#define DMA_MISR_MIS1_Msk        (0x1UL << DMA_MISR_MIS1_Pos)                  /*!< 0x00000002 */
#define DMA_MISR_MIS1            DMA_MISR_MIS1_Msk                            /*!< Masked Interrupt State of Non-Secure Channel 1 */
#define DMA_MISR_MIS2_Pos        (2U)
#define DMA_MISR_MIS2_Msk        (0x1UL << DMA_MISR_MIS2_Pos)                  /*!< 0x00000004 */
#define DMA_MISR_MIS2            DMA_MISR_MIS2_Msk                            /*!< Masked Interrupt State of Non-Secure Channel 2 */
#define DMA_MISR_MIS3_Pos        (3U)
#define DMA_MISR_MIS3_Msk        (0x1UL << DMA_MISR_MIS3_Pos)                  /*!< 0x00000008 */
#define DMA_MISR_MIS3            DMA_MISR_MIS3_Msk                            /*!< Masked Interrupt State of Non-Secure Channel 3 */
#define DMA_MISR_MIS4_Pos        (4U)
#define DMA_MISR_MIS4_Msk        (0x1UL << DMA_MISR_MIS4_Pos)                  /*!< 0x00000010 */
#define DMA_MISR_MIS4            DMA_MISR_MIS4_Msk                            /*!< Masked Interrupt State of Non-Secure Channel 4 */
#define DMA_MISR_MIS5_Pos        (5U)
#define DMA_MISR_MIS5_Msk        (0x1UL << DMA_MISR_MIS5_Pos)                  /*!< 0x00000020 */
#define DMA_MISR_MIS5            DMA_MISR_MIS5_Msk                            /*!< Masked Interrupt State of Non-Secure Channel 5 */
#define DMA_MISR_MIS6_Pos        (6U)
#define DMA_MISR_MIS6_Msk        (0x1UL << DMA_MISR_MIS6_Pos)                  /*!< 0x00000040 */
#define DMA_MISR_MIS6            DMA_MISR_MIS6_Msk                            /*!< Masked Interrupt State of Non-Secure Channel 6 */
#define DMA_MISR_MIS7_Pos        (7U)
#define DMA_MISR_MIS7_Msk        (0x1UL << DMA_MISR_MIS7_Pos)                  /*!< 0x00000080 */
#define DMA_MISR_MIS7            DMA_MISR_MIS7_Msk                            /*!< Masked Interrupt State of Non-Secure Channel 7 */
#define DMA_MISR_MIS8_Pos        (8U)
#define DMA_MISR_MIS8_Msk        (0x1UL << DMA_MISR_MIS8_Pos)                  /*!< 0x00000100 */
#define DMA_MISR_MIS8            DMA_MISR_MIS8_Msk                            /*!< Masked Interrupt State of Non-Secure Channel 8 */
#define DMA_MISR_MIS9_Pos        (9U)
#define DMA_MISR_MIS9_Msk        (0x1UL << DMA_MISR_MIS9_Pos)                  /*!< 0x00000200 */
#define DMA_MISR_MIS9            DMA_MISR_MIS9_Msk                            /*!< Masked Interrupt State of Non-Secure Channel 9 */
#define DMA_MISR_MIS10_Pos       (10U)
#define DMA_MISR_MIS10_Msk       (0x1UL << DMA_MISR_MIS10_Pos)                 /*!< 0x00000400 */
#define DMA_MISR_MIS10           DMA_MISR_MIS10_Msk                           /*!< Masked Interrupt State of Non-Secure Channel 10 */
#define DMA_MISR_MIS11_Pos       (11U)
#define DMA_MISR_MIS11_Msk       (0x1UL << DMA_MISR_MIS11_Pos)                 /*!< 0x00000800 */
#define DMA_MISR_MIS11           DMA_MISR_MIS11_Msk                           /*!< Masked Interrupt State of Non-Secure Channel 11 */
#define DMA_MISR_MIS12_Pos       (12U)
#define DMA_MISR_MIS12_Msk       (0x1UL << DMA_MISR_MIS12_Pos)                 /*!< 0x00001000 */
#define DMA_MISR_MIS12           DMA_MISR_MIS12_Msk                           /*!< Masked Interrupt State of Non-Secure Channel 12 */
#define DMA_MISR_MIS13_Pos       (13U)
#define DMA_MISR_MIS13_Msk       (0x1UL << DMA_MISR_MIS13_Pos)                 /*!< 0x00002000 */
#define DMA_MISR_MIS13           DMA_MISR_MIS13_Msk                           /*!< Masked Interrupt State of Non-Secure Channel 13 */
#define DMA_MISR_MIS14_Pos       (14U)
#define DMA_MISR_MIS14_Msk       (0x1UL << DMA_MISR_MIS14_Pos)                 /*!< 0x00004000 */
#define DMA_MISR_MIS14           DMA_MISR_MIS14_Msk                           /*!< Masked Interrupt State of Non-Secure Channel 14 */
#define DMA_MISR_MIS15_Pos       (15U)
#define DMA_MISR_MIS15_Msk       (0x1UL << DMA_MISR_MIS15_Pos)                 /*!< 0x00008000 */
#define DMA_MISR_MIS15           DMA_MISR_MIS14_Msk                           /*!< Masked Interrupt State of Non-Secure Channel 15 */

